# GetConduitSizeSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeSettings..::..GetConduitSizeSettings Method
ConduitSizeSettings Class See Also
---
Gets the conduit size settings of the project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static ConduitSizeSettings GetConduitSizeSettings(
	Document aDoc
)
```

Visual Basic
---
```text
Public Shared Function GetConduitSizeSettings ( _
	aDoc As Document _
) As ConduitSizeSettings
```

Visual C++
---
```text
public:
static ConduitSizeSettings^ GetConduitSizeSettings(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The conduit size settings of the project.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace